mathiasvr/silabs-8051-sdk/Device/EFM8BB51/inc/SI_EFM8BB51_Register_Enums.h
#define CP0CN_EN_CP__BMASK             0x80 ///< Enable Charge Pump              
#define CP0CN_EN_CP__SHIFT             0x07 ///< Enable Charge Pump              
#define CP0CN_EN_CP__DISABLED          0x00 ///< VDDCP voltage is set to VDD.    
#define CP0CN_EN_CP__ENABLED           0x80 ///< VDDCP voltage is set to LDO x 3.
                                                                                 
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PFE0CN Enums (Prefetch Engine Control @ 0xC1)
//------------------------------------------------------------------------------
#define PFE0CN_FLRT__BMASK               0x10 ///< Flash Read Timing                                 
#define PFE0CN_FLRT__SHIFT               0x04 ///< Flash Read Timing                                 
#define PFE0CN_FLRT__SYSCLK_BELOW_25_MHZ 0x00 ///< Disables the Prefetch Engine when SYSCLK < 25 MHz.
#define PFE0CN_FLRT__SYSCLK_BELOW_50_MHZ 0x10 ///< Enables the Prefetch Engine when SYSCLK < 50 MHz. 
                                                                                                     
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
#define PSW_OV__BMASK       0x04 ///< Overflow Flag                                     
#define PSW_OV__SHIFT       0x02 ///< Overflow Flag                                     
#define PSW_OV__NOT_SET     0x00 ///< An overflow did not occur.                        
#define PSW_OV__SET         0x04 ///< An overflow occurred.                             
                                                                                        
#define PSW_RS__FMASK       0x18 ///< Register Bank Select                              
#define PSW_RS__SHIFT       0x03 ///< Register Bank Select                              
#define PSW_RS__BANK0       0x00 ///< Bank 0, Addresses 0x00-0x07                       
#define PSW_RS__BANK1       0x08 ///< Bank 1, Addresses 0x08-0x0F                       
#define PSW_RS__BANK2       0x10 ///< Bank 2, Addresses 0x10-0x17                       
#define PSW_RS__BANK3       0x18 ///< Bank 3, Addresses 0x18-0x1F                       
                                                                                        
#define PSW_F0__BMASK       0x20 ///< User Flag 0                                       
#define PSW_F0__SHIFT       0x05 ///< User Flag 0                                       
#define PSW_F0__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F0__SET         0x20 ///< Flag is set.                                      
                                                                                        
#define PSW_AC__BMASK       0x40 ///< Auxiliary Carry Flag                              
#define PSW_AC__SHIFT       0x06 ///< Auxiliary Carry Flag                              
#define PSW_AC__NOT_SET     0x00 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble did not occur.
#define PSW_AC__SET         0x40 ///< A carry into (addition) or borrow from            
                                 ///< (subtraction) the high order nibble occurred.     
                                                                                        
#define PSW_CY__BMASK       0x80 ///< Carry Flag                                        
#define PSW_CY__SHIFT       0x07 ///< Carry Flag                                        
#define PSW_CY__NOT_SET     0x00 ///< A carry (addition) or borrow (subtraction) did not
                                 ///< occur.                                            
#define PSW_CY__SET         0x80 ///< A carry (addition) or borrow (subtraction)        
                                 ///< occurred.                                         
                                                                                        
//------------------------------------------------------------------------------
// SP Enums (Stack Pointer @ 0x81)
//------------------------------------------------------------------------------
#define SP_SP__FMASK 0xFF ///< Stack Pointer
#define SP_SP__SHIFT 0x00 ///< Stack Pointer
                                            
//------------------------------------------------------------------------------
// CLKGRP0 Enums (Clock Group Control @ 0xAF)
//------------------------------------------------------------------------------
#define CLKGRP0_CLKGRP0SL__FMASK         0x03 ///< Clock Group Source Select                     
#define CLKGRP0_CLKGRP0SL__SHIFT         0x00 ///< Clock Group Source Select                     
#define CLKGRP0_CLKGRP0SL__SYSCLK        0x00 ///< Select SYSCLK divided by CLKDIVSL (50 MHz     
                                              ///< maximum).                                     
#define CLKGRP0_CLKGRP0SL__HFO_DIV2      0x01 ///< Select HFO divided by 2 (25 MHz maximum).     
#define CLKGRP0_CLKGRP0SL__SYSCLK_PREDIV 0x02 ///< Select pre-divided SYSCLK (50 MHz maximum).   
                                                                                                 
#define CLKGRP0_CLKDIVSL__FMASK          0x0C ///< Clock Group Divider Select                    
#define CLKGRP0_CLKDIVSL__SHIFT          0x02 ///< Clock Group Divider Select                    
#define CLKGRP0_CLKDIVSL__DIV1           0x00 ///< Divide selected clock group by 1.             
#define CLKGRP0_CLKDIVSL__DIV2           0x04 ///< Divide selected clock group by 2.             
#define CLKGRP0_CLKDIVSL__DIV4           0x08 ///< Divide selected clock group by 4.             
#define CLKGRP0_CLKDIVSL__DIV8           0x0C ///< Divide selected clock group by 8.             
                                                                                                 
#define CLKGRP0_EN_SARCLK__BMASK         0x10 ///< SAR Clock Enable                              
#define CLKGRP0_EN_SARCLK__SHIFT         0x04 ///< SAR Clock Enable                              
#define CLKGRP0_EN_SARCLK__DISABLE       0x00 ///< Disable SAR clock.                            
#define CLKGRP0_EN_SARCLK__ENABLE        0x10 ///< Enable SAR clock.                             
                                                                                                 
