mathiasvr/silabs-8051-sdk/Device/EFM8BB51/inc/SI_EFM8BB51_Register_Enums.h
#define CLKGRP0_EN_CPCLK__BMASK          0x20 ///< Charge Pump Refresh Enable                    
#define CLKGRP0_EN_CPCLK__SHIFT          0x05 ///< Charge Pump Refresh Enable                    
#define CLKGRP0_EN_CPCLK__DISABLE        0x00 ///< Disable charge pump refresh clock.            
#define CLKGRP0_EN_CPCLK__ENABLE         0x20 ///< Enable charge pump refresh clock.             
                                                                                                 
#define CLKGRP0_CLKGRP0BUSY__BMASK       0x80 ///< Clock Group Status                            
#define CLKGRP0_CLKGRP0BUSY__SHIFT       0x07 ///< Clock Group Status                            
#define CLKGRP0_CLKGRP0BUSY__READY       0x00 ///< No clock switch in progress or clock switch is
                                              ///< done.                                         
#define CLKGRP0_CLKGRP0BUSY__BUSY        0x80 ///< Clock switch in progress.                     
                                                                                                 
//------------------------------------------------------------------------------
// CLKSEL Enums (Clock Select @ 0xA9)
//------------------------------------------------------------------------------
#define CLKSEL_CLKSL__FMASK                  0x07 ///< Clock Source Select                             
#define CLKSEL_CLKSL__SHIFT                  0x00 ///< Clock Source Select                             
#define CLKSEL_CLKSL__HFOSC0_clk24p5         0x00 ///< Clock derived from the Internal High Frequency  
                                                  ///< Oscillator 24.5 MHz.                            
#define CLKSEL_CLKSL__EXTOSC                 0x01 ///< Clock derived from the External Oscillator      
                                                  ///< circuit.                                        
#define CLKSEL_CLKSL__LFOSC                  0x02 ///< Clock derived from the Internal Low-Frequency   
                                                  ///< Oscillator.                                     
#define CLKSEL_CLKSL__HFOSC0_clk49           0x03 ///< Clock derived from the Internal High Frequency  
                                                  ///< Oscillator 49 MHz.                              
#define CLKSEL_CLKSL__HFOSC0_clk24p5_div_1p5 0x04 ///< Clock derived from the Internal High Frequency  
                                                  ///< Oscillator 24.5 MHz, pre-scaled by 1.5.         
#define CLKSEL_CLKSL__FSRCO_clk10            0x05 ///< Clock derived from the Internal Fast Start Up   
                                                  ///< Oscillator.                                     
#define CLKSEL_CLKSL__FSRCO_clk2p5           0x06 ///< Clock derived from the Internal Fast Start Up   
                                                  ///< Oscillator with 4x prescale (2.5 MHz).          
#define CLKSEL_CLKSL__HFOSC0_clk49_div_1p5   0x07 ///< Clock derived from the Internal High Frequency  
                                                  ///< Oscillator 49 MHz, pre-scaled by 1.5.           
                                                                                                       
#define CLKSEL_CLKDIV__FMASK                 0x70 ///< Clock Source Divider                            
#define CLKSEL_CLKDIV__SHIFT                 0x04 ///< Clock Source Divider                            
#define CLKSEL_CLKDIV__SYSCLK_DIV_1          0x00 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 1.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_2          0x10 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 2.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_4          0x20 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 4.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_8          0x30 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 8.                                           
#define CLKSEL_CLKDIV__SYSCLK_DIV_16         0x40 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 16.                                          
#define CLKSEL_CLKDIV__SYSCLK_DIV_32         0x50 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 32.                                          
#define CLKSEL_CLKDIV__SYSCLK_DIV_64         0x60 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 64.                                          
#define CLKSEL_CLKDIV__SYSCLK_DIV_128        0x70 ///< SYSCLK is equal to selected clock source divided
                                                  ///< by 128.                                         
                                                                                                       
#define CLKSEL_DIVRDY__BMASK                 0x80 ///< Clock Divider Ready                             
#define CLKSEL_DIVRDY__SHIFT                 0x07 ///< Clock Divider Ready                             
#define CLKSEL_DIVRDY__NOT_READY             0x00 ///< Clock has not propagated through divider yet.   
#define CLKSEL_DIVRDY__READY                 0x80 ///< Clock has propagated through divider.           
                                                                                                       
//------------------------------------------------------------------------------
// CLU0CF Enums (Configurable Logic Unit 0 Configuration @ 0xB1)
//------------------------------------------------------------------------------
#define CLU0CF_CLKSEL__FMASK     0x03 ///< CLU D flip-flop Clock Selection                  
#define CLU0CF_CLKSEL__SHIFT     0x00 ///< CLU D flip-flop Clock Selection                  
#define CLU0CF_CLKSEL__CARRY_IN  0x00 ///< The carry-in signal.                             
#define CLU0CF_CLKSEL__MXA_INPUT 0x01 ///< The MXA input.                                   
#define CLU0CF_CLKSEL__ALTCLK0   0x02 ///< The alternate clock signal CLU0ALTCLK0.          
#define CLU0CF_CLKSEL__ALTCLK1   0x03 ///< The alternate clock signal CLU0ALTCLK1.          
                                                                                            
