mathiasvr/silabs-8051-sdk/Device/EFM8BB51/inc/SI_EFM8BB51_Register_Enums.h
#define LFO0CN_LFORDY__BMASK       0x40 ///< Internal L-F Oscillator Ready                    
#define LFO0CN_LFORDY__SHIFT       0x06 ///< Internal L-F Oscillator Ready                    
#define LFO0CN_LFORDY__NOT_SET     0x00 ///< Internal L-F Oscillator frequency not stabilized.
#define LFO0CN_LFORDY__SET         0x40 ///< Internal L-F Oscillator frequency stabilized.    
                                                                                              
#define LFO0CN_OSCLEN__BMASK       0x80 ///< Internal L-F Oscillator Enable                   
#define LFO0CN_OSCLEN__SHIFT       0x07 ///< Internal L-F Oscillator Enable                   
#define LFO0CN_OSCLEN__DISABLED    0x00 ///< Internal L-F Oscillator Disabled (LFOSC is       
                                        ///< automatically enabled when the watchdog timer is 
                                        ///< active).                                         
#define LFO0CN_OSCLEN__ENABLED     0x80 ///< Internal L-F Oscillator Enabled.                 
                                                                                              
//------------------------------------------------------------------------------
// PRTDRV Enums (Port Drive Strength @ 0xF6)
//------------------------------------------------------------------------------
#define PRTDRV_P0DRV__BMASK      0x01 ///< Port 0 Drive Strength                  
#define PRTDRV_P0DRV__SHIFT      0x00 ///< Port 0 Drive Strength                  
#define PRTDRV_P0DRV__LOW_DRIVE  0x00 ///< All pins on P0 use low drive strength. 
#define PRTDRV_P0DRV__HIGH_DRIVE 0x01 ///< All pins on P0 use high drive strength.
                                                                                  
#define PRTDRV_P1DRV__BMASK      0x02 ///< Port 1 Drive Strength                  
#define PRTDRV_P1DRV__SHIFT      0x01 ///< Port 1 Drive Strength                  
#define PRTDRV_P1DRV__LOW_DRIVE  0x00 ///< All pins on P1 use low drive strength. 
#define PRTDRV_P1DRV__HIGH_DRIVE 0x02 ///< All pins on P1 use high drive strength.
                                                                                  
#define PRTDRV_P2DRV__BMASK      0x04 ///< Port 2 Drive Strength                  
#define PRTDRV_P2DRV__SHIFT      0x02 ///< Port 2 Drive Strength                  
#define PRTDRV_P2DRV__LOW_DRIVE  0x00 ///< All pins on P2 use low drive strength. 
#define PRTDRV_P2DRV__HIGH_DRIVE 0x04 ///< All pins on P2 use high drive strength.
                                                                                  
#define PRTDRV_COEX__BMASK       0x80 ///< I/O Coexistence Enable                 
#define PRTDRV_COEX__SHIFT       0x07 ///< I/O Coexistence Enable                 
#define PRTDRV_COEX__DISABLED    0x00 ///< Coexistence disabled.                  
#define PRTDRV_COEX__ENABLED     0x80 ///< Coexistence enabled.                   
                                                                                  
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT0E__BMASK     0x01 ///< UART0 I/O Enable                                 
#define XBR0_URT0E__SHIFT     0x00 ///< UART0 I/O Enable                                 
#define XBR0_URT0E__DISABLED  0x00 ///< UART0 I/O unavailable at Port pin.               
#define XBR0_URT0E__ENABLED   0x01 ///< UART0 TX0, RX0 routed to Port pins P0.4 and P0.5.
                                                                                         
#define XBR0_SPI0E__BMASK     0x02 ///< SPI I/O Enable                                   
#define XBR0_SPI0E__SHIFT     0x01 ///< SPI I/O Enable                                   
#define XBR0_SPI0E__DISABLED  0x00 ///< SPI I/O unavailable at Port pins.                
#define XBR0_SPI0E__ENABLED   0x02 ///< SPI I/O routed to Port pins. The SPI can be      
                                   ///< assigned either 3 or 4 GPIO pins.                
                                                                                         
#define XBR0_SMB0E__BMASK     0x04 ///< SMB0 I/O Enable                                  
#define XBR0_SMB0E__SHIFT     0x02 ///< SMB0 I/O Enable                                  
#define XBR0_SMB0E__DISABLED  0x00 ///< SMBus 0 I/O unavailable at Port pins.            
#define XBR0_SMB0E__ENABLED   0x04 ///< SMBus 0 I/O routed to Port pins.                 
                                                                                         
#define XBR0_CP0E__BMASK      0x08 ///< Comparator0 Output Enable                        
#define XBR0_CP0E__SHIFT      0x03 ///< Comparator0 Output Enable                        
#define XBR0_CP0E__DISABLED   0x00 ///< CP0 unavailable at Port pin.                     
#define XBR0_CP0E__ENABLED    0x08 ///< CP0 routed to Port pin.                          
                                                                                         
#define XBR0_CP0AE__BMASK     0x10 ///< Comparator0 Asynchronous Output Enable           
#define XBR0_CP0AE__SHIFT     0x04 ///< Comparator0 Asynchronous Output Enable           
#define XBR0_CP0AE__DISABLED  0x00 ///< Asynchronous CP0 unavailable at Port pin.        
#define XBR0_CP0AE__ENABLED   0x10 ///< Asynchronous CP0 routed to Port pin.             
                                                                                         
#define XBR0_CP1E__BMASK      0x20 ///< Comparator1 Output Enable                        
#define XBR0_CP1E__SHIFT      0x05 ///< Comparator1 Output Enable                        
#define XBR0_CP1E__DISABLED   0x00 ///< CP1 unavailable at Port pin.                     
#define XBR0_CP1E__ENABLED    0x20 ///< CP1 routed to Port pin.                          
                                                                                         
#define XBR0_CP1AE__BMASK     0x40 ///< Comparator1 Asynchronous Output Enable           
#define XBR0_CP1AE__SHIFT     0x06 ///< Comparator1 Asynchronous Output Enable           
#define XBR0_CP1AE__DISABLED  0x00 ///< Asynchronous CP1 unavailable at Port pin.        
#define XBR0_CP1AE__ENABLED   0x40 ///< Asynchronous CP1 routed to Port pin.             
                                                                                         
