mathiasvr/silabs-8051-sdk/Device/EFM8BB51/inc/SI_EFM8BB51_Register_Enums.h
#define PWMCFG3_CH2XSAFST__BMASK  0x10 ///< Channel 2 X Safe State                       
#define PWMCFG3_CH2XSAFST__SHIFT  0x04 ///< Channel 2 X Safe State                       
#define PWMCFG3_CH2XSAFST__SAFE0  0x00 ///< Set CH2X's safe state to 0.                  
#define PWMCFG3_CH2XSAFST__SAFE1  0x10 ///< Set CH2X's safe state to 1.                  
                                                                                         
#define PWMCFG3_CH2YSAFST__BMASK  0x20 ///< Channel 2 Y Safe State                       
#define PWMCFG3_CH2YSAFST__SHIFT  0x05 ///< Channel 2 Y Safe State                       
#define PWMCFG3_CH2YSAFST__SAFE0  0x00 ///< Set CH2Y's safe state to 0.                  
#define PWMCFG3_CH2YSAFST__SAFE1  0x20 ///< Set CH2Y's safe state to 1.                  
                                                                                         
#define PWMCFG3_PWMSNP__FMASK     0xC0 ///< Snap 16-bit registers for reading            
#define PWMCFG3_PWMSNP__SHIFT     0x06 ///< Snap 16-bit registers for reading            
#define PWMCFG3_PWMSNP__SNPCH0    0x00 ///< Takes a snapshot of Channel 0's Compare Value
                                       ///< registers for reading.                       
#define PWMCFG3_PWMSNP__SNPCH0CTR 0x40 ///< Takes a snapshot of Channel 0's Compare Value
                                       ///< registers and the PWM Counter registers for  
                                       ///< reading.                                     
#define PWMCFG3_PWMSNP__SNPCH1CH2 0x80 ///< Takes a snapshot of Channel 1 and Channel 2's
                                       ///< Compare Value registers for reading.         
                                                                                         
//------------------------------------------------------------------------------
// PWMCKDIV Enums (PWM Clock Divider @ 0xE3)
//------------------------------------------------------------------------------
#define PWMCKDIV_PWMCKDIV__FMASK 0x0F ///< PWM Clock Divider
#define PWMCKDIV_PWMCKDIV__SHIFT 0x00 ///< PWM Clock Divider
                                                            
//------------------------------------------------------------------------------
// PWMDTINLIM Enums (DTI Negative Limit @ 0xE2)
//------------------------------------------------------------------------------
#define PWMDTINLIM_PWMDTINLIM__FMASK 0xFF ///< DTI Negative Limit
#define PWMDTINLIM_PWMDTINLIM__SHIFT 0x00 ///< DTI Negative Limit
                                                                 
//------------------------------------------------------------------------------
// PWMDTIPLIM Enums (DTI Positive Limit @ 0xE1)
//------------------------------------------------------------------------------
#define PWMDTIPLIM_PWMDTIPLIM__FMASK 0xFF ///< DTI Positive Limit
#define PWMDTIPLIM_PWMDTIPLIM__SHIFT 0x00 ///< DTI Positive Limit
                                                                 
//------------------------------------------------------------------------------
// PWMH Enums (PWM Counter MSB @ 0xC4)
//------------------------------------------------------------------------------
#define PWMH_PWMH__FMASK 0xFF ///< PWM Counter MSB
#define PWMH_PWMH__SHIFT 0x00 ///< PWM Counter MSB
                                                  
//------------------------------------------------------------------------------
// PWMIE Enums (PWM Interrupt Enable @ 0x9F)
//------------------------------------------------------------------------------
#define PWMIE_CH0MATIE__BMASK   0x01 ///< Ch0 Compare Match Interrupt Enable                
#define PWMIE_CH0MATIE__SHIFT   0x00 ///< Ch0 Compare Match Interrupt Enable                
#define PWMIE_CH0MATIE__DISABLE 0x00 ///< Interrupts will not be generated for Channel 0    
                                     ///< Compare Match events.                             
#define PWMIE_CH0MATIE__ENABLE  0x01 ///< Interrupts will be generated for Channel 0 Compare
                                     ///< Match events.                                     
                                                                                            
#define PWMIE_CH1MATIE__BMASK   0x02 ///< Ch1 Compare Match Interrupt Enable                
#define PWMIE_CH1MATIE__SHIFT   0x01 ///< Ch1 Compare Match Interrupt Enable                
#define PWMIE_CH1MATIE__DISABLE 0x00 ///< Interrupts will not be generated for Channel 1    
                                     ///< Compare Match events.                             
#define PWMIE_CH1MATIE__ENABLE  0x02 ///< Interrupts will be generated for Channel 1 Compare
                                     ///< Match events.                                     
                                                                                            
#define PWMIE_CH2MATIE__BMASK   0x04 ///< Ch2 Compare Match Interrupt Enable                
#define PWMIE_CH2MATIE__SHIFT   0x02 ///< Ch2 Compare Match Interrupt Enable                
#define PWMIE_CH2MATIE__DISABLE 0x00 ///< Interrupts will not be generated for Channel 2    
                                     ///< Compare Match events.                             
#define PWMIE_CH2MATIE__ENABLE  0x04 ///< Interrupts will be generated for Channel 2 Compare
                                     ///< Match events.                                     
                                                                                            
#define PWMIE_CTROVIE__BMASK    0x08 ///< Counter Overflow Interrupt Enable                 
#define PWMIE_CTROVIE__SHIFT    0x03 ///< Counter Overflow Interrupt Enable                 
#define PWMIE_CTROVIE__DISABLE  0x00 ///< Interrupts will not be generated by a counter     
                                     ///< overflow.                                         
#define PWMIE_CTROVIE__ENABLE   0x08 ///< Interrupts will be generated by a counter         
                                     ///< overflow.                                         
                                                                                            
