mathiasvr/silabs-8051-sdk/Device/EFM8BB51/inc/SI_EFM8BB51_Register_Enums.h
#define UART1LIN_BREAKDN__BMASK      0x40 ///< LIN Break Done Flag                               
#define UART1LIN_BREAKDN__SHIFT      0x06 ///< LIN Break Done Flag                               
#define UART1LIN_BREAKDN__NOT_SET    0x00 ///< A LIN break has not been detected.                
#define UART1LIN_BREAKDN__BREAK      0x40 ///< A LIN break was detected since the flag was last  
                                          ///< cleared.                                          
                                                                                                 
#define UART1LIN_AUTOBDE__BMASK      0x80 ///< Auto Baud Detection Enable                        
#define UART1LIN_AUTOBDE__SHIFT      0x07 ///< Auto Baud Detection Enable                        
#define UART1LIN_AUTOBDE__DISABLED   0x00 ///< Autobaud is not enabled.                          
#define UART1LIN_AUTOBDE__ENABLED    0x80 ///< Autobaud is enabled.                              
                                                                                                 
//------------------------------------------------------------------------------
// UART1PCF Enums (UART1 Pin Configuration @ 0xDA)
//------------------------------------------------------------------------------
#define UART1PCF_RXSEL__FMASK    0x03 ///< RX Input Select                           
#define UART1PCF_RXSEL__SHIFT    0x00 ///< RX Input Select                           
#define UART1PCF_RXSEL__CROSSBAR 0x00 ///< RX is connected to the pin assigned by the
                                      ///< crossbar.                                 
#define UART1PCF_RXSEL__CLU0     0x01 ///< RX is connected to the CLU0 output signal.
#define UART1PCF_RXSEL__CLU1     0x02 ///< RX is connected to the CLU1 output signal.
#define UART1PCF_RXSEL__CLU2     0x03 ///< RX is connected to the CLU2 output signal.
                                                                                     
//------------------------------------------------------------------------------
// SBUF0 Enums (UART0 Serial Port Data Buffer @ 0x99)
//------------------------------------------------------------------------------
#define SBUF0_SBUF0__FMASK 0xFF ///< Serial Data Buffer
#define SBUF0_SBUF0__SHIFT 0x00 ///< Serial Data Buffer
                                                       
//------------------------------------------------------------------------------
// SCON0 Enums (UART0 Serial Port Control @ 0x98)
//------------------------------------------------------------------------------
#define SCON0_RI__BMASK             0x01 ///< Receive Interrupt Flag                           
#define SCON0_RI__SHIFT             0x00 ///< Receive Interrupt Flag                           
#define SCON0_RI__NOT_SET           0x00 ///< New data has not been received by UART0.         
#define SCON0_RI__SET               0x01 ///< UART0 received one or more data bytes.           
                                                                                               
#define SCON0_TI__BMASK             0x02 ///< Transmit Interrupt Flag                          
#define SCON0_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                          
#define SCON0_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART0.
#define SCON0_TI__SET               0x02 ///< UART0 transmitted a byte of data.                
                                                                                               
#define SCON0_RB8__BMASK            0x04 ///< Ninth Receive Bit                                
#define SCON0_RB8__SHIFT            0x02 ///< Ninth Receive Bit                                
#define SCON0_RB8__NOT_SET          0x00 ///< In Mode 0, the STOP bit was 0. In Mode 1, the 9th
                                         ///< bit was 0.                                       
#define SCON0_RB8__SET              0x04 ///< In Mode 0, the STOP bit was 1. In Mode 1, the 9th
                                         ///< bit was 1.                                       
                                                                                               
#define SCON0_TB8__BMASK            0x08 ///< Ninth Transmission Bit                           
#define SCON0_TB8__SHIFT            0x03 ///< Ninth Transmission Bit                           
#define SCON0_TB8__NOT_SET          0x00 ///< In Mode 1, set the 9th transmission bit to 0.    
#define SCON0_TB8__SET              0x08 ///< In Mode 1, set the 9th transmission bit to 1.    
                                                                                               
#define SCON0_REN__BMASK            0x10 ///< Receive Enable                                   
#define SCON0_REN__SHIFT            0x04 ///< Receive Enable                                   
#define SCON0_REN__RECEIVE_DISABLED 0x00 ///< UART0 reception disabled.                        
#define SCON0_REN__RECEIVE_ENABLED  0x10 ///< UART0 reception enabled.                         
                                                                                               
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// UART0PCF Enums (UART0 Pin Configuration @ 0xD9)
//------------------------------------------------------------------------------
#define UART0PCF_RXSEL__FMASK    0x03 ///< RX Input Select                           
#define UART0PCF_RXSEL__SHIFT    0x00 ///< RX Input Select                           
#define UART0PCF_RXSEL__CROSSBAR 0x00 ///< RX is connected to the pin assigned by the
                                      ///< crossbar.                                 
#define UART0PCF_RXSEL__CLU0     0x01 ///< RX is connected to the CLU0 output signal.
#define UART0PCF_RXSEL__CLU1     0x02 ///< RX is connected to the CLU1 output signal.
#define UART0PCF_RXSEL__CLU2     0x03 ///< RX is connected to the CLU2 output signal.
                                                                                     
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_GAIN__FMASK      0x30 ///< VREF Gain                                       
#define REF0CN_GAIN__SHIFT      0x04 ///< VREF Gain                                       
#define REF0CN_GAIN__GAIN1X     0x00 ///< The 1x gain setting results in a 1.2 V output.  
#define REF0CN_GAIN__GAIN1P375X 0x10 ///< The 1.375x gain setting results in a 1.65 V     
                                     ///< output.                                         
#define REF0CN_GAIN__GAIN1P5X   0x20 ///< The 1.5x gain setting results in a 1.8 V output.
#define REF0CN_GAIN__GAIN2X     0x30 ///< The 2.0x gain setting results in a 2.4 V output.
                                                                                          
