mathiasvr/silabs-8051-sdk/Device/EFM8BB51/inc/SI_EFM8BB51_Register_Enums.h
#define REF0CN_EN__BMASK        0x80 ///< Voltage Reference Enable                        
#define REF0CN_EN__SHIFT        0x07 ///< Voltage Reference Enable                        
#define REF0CN_EN__DISABLE      0x00 ///< The VREF pin is not driven by an on-chip        
                                     ///< reference. It may be driven with an external    
                                     ///< reference.                                      
#define REF0CN_EN__ENABLE       0x80 ///< The VREF pin is driven by the on-chip voltage   
                                     ///< reference.                                      
                                                                                          
//------------------------------------------------------------------------------
// WDTCN Enums (Watchdog Timer Control @ 0x97)
//------------------------------------------------------------------------------
#define WDTCN_WDTCN__FMASK 0xFF ///< WDT Control
#define WDTCN_WDTCN__SHIFT 0x00 ///< WDT Control
                                                
//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xE7)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__FMASK 0x03 ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select
                                                      
#endif // SI_EFM8BB51_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

